Repository: pkscout/script.artistslideshow
Catalog: resources/language/resource.language.*/strings.po
Languages: ga

# Addon Summary
source: Download images and additional info of the currently playing artist
ga: Íoslódáil íomhánna agus eolas breise faoin ealaíontóir atá ag seinm faoi láthair

# Addon Description
source: Addon to download images and additional information from fanart.tv and theaudiodb.com of the currently playing artist. The images, along with local artists' images, and info can be used by the skin to create a slideshow for the artist being listened to.
ga: Breiseán chun íomhánna agus faisnéis bhreise a íoslódáil ó fanart.tv agus theaudiodb.com den ealaíontóir atá ag seinm faoi láthair. Is féidir leis an gcraiceann na híomhánna, mar aon le híomhánna agus faisnéis na n-ealaíontóirí áitiúla, a úsáid chun sleamhnán a chruthú don ealaíontóir atá á éisteacht.

# #32000
source: Slideshow
ga: Sleamhnán

# #32001
source: Storage
ga: Stóráil

# #32002
source: Images
ga: Íomhánna

# #32003
source: Album Info
ga: Eolas faoin Albam

# #32004
source: Artist Bio
ga: Beathaisnéis an Ealaíontóra

# #32005
source: Similar Artists
ga: Ealaíontóirí Cosúla

# #32006
source: Advanced
ga: Ardleibhéil

# #32101
source: Download images from fanart.tv
ga: Íoslódáil íomhánna ó fanart.tv

# #32102
source: Download images from theaudiodb.com
ga: Íoslódáil íomhánna ó theaudiodb.com

# #32103
source: Download album info from the audiodb.com
ga: Íoslódáil eolas albam ó audiodb.com

# #32104
source: Download album info from the last.fm
ga: Íoslódáil eolas albam ó last.fm

# #32105
source: Download artist bio from theaudiodb.com
ga: Íoslódáil beathaisnéis an ealaíontóra ó theaudiodb.com

# #32106
source: Download artist bio from last.fm
ga: Íoslódáil beathaisnéis an ealaíontóra ó last.fm

# #32107
source: Download similar artists from last.fm
ga: Íoslódáil ealaíontóirí comhchosúla ó last.fm

# #32108
source: Download all images regardless of resolution
ga: Íoslódáil gach íomhá beag beann ar réiteach

# #32109
source: Client API key
ga: Eochair API cliant

# #32110
source: I donate to this service
ga: Déanaim síntiús don tseirbhís seo

# #32111
source: Use fallback slideshow
ga: Úsáid sleamhnán cúltaca

# #32112
source: Use override slideshow
ga: Úsáid sleamhnán sáraithe

# #32113
source: Custom location
ga: Suíomh saincheaptha

# #32114
source: Include Kodi artist fanart
ga: Cuir ealaín lucht leanúna ealaíontóra Kodi san áireamh

# #32115
source: Include Kodi album fanart
ga: Cuir ealaín lucht leanúna albam Kodi san áireamh

# #32116
source: Limit size of download cache
ga: Teorainn a chur le méid an taisce íoslódála

# #32117
source: Maximum cache size (in megabytes)
ga: Uasmhéid an taisce (i meigibheart)

# #32118
source: Alternate name for local fanart folder
ga: Ainm malartach don fhillteán áitiúil d’ealaín lucht leanúna

# #32119
source: Enable debug logging
ga: Cumasaigh logáil dífhabhtaithe

# #32120
source: Disable secondary and featured artist images
ga: Díchumasaigh íomhánna ealaíontóra tánaisteacha agus ealaíontóra le feiceáil

# #32121
source: Store artist images in
ga: Stóráil íomhánna ealaíontóra i

# #32122
source: addon_data folder
ga: fillteán addon_data

# #32123
source: Kodi artist information folder
ga: Fillteán faisnéise ealaíontóra Kodi

# #32124
source: Priority
ga: Tosaíocht

# #32125
source: Store artist information in
ga: Stóráil faisnéis an ealaíontóra i

# #32126
source: Preferred language for artist bio
ga: Teanga is fearr le haghaidh beathaisnéis an ealaíontóra

# #32127
source: Use extrafanart folder
ga: Úsáid fillteán extrafanart

# #32128
source: Platform for image storage
ga: Ardán le haghaidh stórála íomhánna

# #32129
source: Replace illegal path characters in artist name with
ga: Cuir carachtair chosáin mhídhleathacha in ainm an ealaíontóra in ionad

# #32130
source: Replace trailing period in artist name with
ga: Cuir ponc deiridh in ainm an ealaíontóra in ionad

# #32131
source: Windows
ga: Fuinneoga

# #32132
source: Other
ga: Eile

# #32134
source: Move images to Kodi music artist folder
ga: Bog íomhánna chuig fillteán ealaíontóra ceoil Kodi

# #32135
source: Get artist bio from Kodi
ga: Faigh beathaisnéis an ealaíontóra ó Kodi

# #32136
source: Custom location
ga: Suíomh saincheaptha

# #32137
source: Delay between slide transitions (in seconds)
ga: Moill idir aistrithe sleamhnán (i soicindí)

# #32138
source: Fade to black during change in artists
ga: Céimniú go dubh le linn athrú ealaíontóirí

# #32139
source: Main thread sleep time (in seconds)
ga: Am codlata an phríomhshnáithe (i soicindí)

# #32140
source: Main thread idle sleep time (in seconds)
ga: Am codlata díomhaoin an phríomhshnáithe (i soicindí)

# #32141
source: Slideshow thread sleep time (in seconds)
ga: Am codlata snáithe sleamhnán (i soicindí)

# #32142
source: Show notification during image downloads
ga: Taispeáin fógra le linn íoslódálacha íomhánna

# #32143
source: Only show notification if there are images to download
ga: Taispeáin fógra ach amháin má tá íomhánna le híoslódáil

# #32144
source: Use more agressive artist search for streams
ga: Úsáid cuardach ealaíontóra níos ionsaithí le haghaidh sruthanna

# #32145
source: Pause slideshow on playback pause
ga: Sos ar an taispeántas sleamhnán nuair a bhíonn an athsheinm ar sos

# #32200
source: Artist Slideshow
ga: Sleamhnán an Ealaíontóra

# #32201
source: Warning
ga: Rabhadh

# #32202
source: Error
ga: Earráid

# #32203
source: Progress
ga: Dul Chun Cinn

# #32204
source: Downloading
ga: Ag íoslódáil

# #32205
source: Download Complete
ga: Íoslódáil Críochnaithe

# #32300
source: This will move and rename your image files and cannot be undone. Are you sure you want to do this?
ga: Bogfaidh agus athainmneoidh sé seo do chuid comhad íomhá agus ní féidir é a chealú. An bhfuil tú cinnte gur mian leat é seo a dhéanamh?

# #32301
source: Unable to retrieve path to Kodi music artist image storage. Please check Settings > Media > Music and ensure the Artist Information Folder is set.
ga: Ní féidir cosán a aisghabháil chuig stóras íomhá ealaíontóra ceoil Kodi. Seiceáil Socruithe > Meáin > Ceol agus cinntigh go bhfuil an Fillteán Faisnéise Ealaíontóra socraithe.

# #32302
source: Artist Slideshow is already set to use the Kodi artist information folder. Please set to use either addon_data folder or a custom location and try again.
ga: Tá Sleamhnán an Ealaíontóra socraithe cheana féin chun fillteán faisnéise ealaíontóra Kodi a úsáid. Socraigh chun fillteán addon_data nó suíomh saincheaptha a úsáid agus déan iarracht arís.

# #32303
source: Moving and renaming images from custom location...
ga: Íomhánna á mbogadh agus á n-athainmniú ó shuíomh saincheaptha...

# #32304
source: Moving and renaming images from addon_data folder...
ga: Íomhánna á mbogadh agus á n-athainmniú ón bhfillteán addon_data...

# #32305
source: No artist directories found.
ga: Níor aimsíodh aon eolairí ealaíontóirí.

# #32306
source: Image move complete. You may now change the Artist Slideshow storage location to Kodi artist information folder.
ga: Bogadh íomhá críochnaithe. Is féidir leat suíomh stórála Sleamhnán Taispeántais an Ealaíontóra a athrú anois go fillteán faisnéise ealaíontóra Kodi.

# #32307
source: Downloading new artist images
ga: Íoslódáil íomhánna nua d’ealaíontóirí

# #32308
source: artist images downloaded
ga: Íomhánna ealaíontóra íoslódáilte

# #32309
source: artist image downloaded
ga: Íomhá an ealaíontóra íoslódáilte

# #32901
source: Albanian
ga: Albáinis

# #32902
source: Arabic
ga: Araibis

# #32903
source: Belarusian
ga: Bealarúisis

# #32904
source: Bosnian (Latin)
ga: Boisnis (Laidin)

# #32905
source: Bulgarian
ga: Bulgáiris

# #32906
source: Catalan
ga: Catalóinis

# #32907
source: Chinese
ga: Sínis

# #32908
source: Croatian
ga: Cróitis

# #32909
source: Czech
ga: Seiceach

# #32910
source: Danish
ga: Danmhairgis

# #32911
source: Dutch
ga: Ollainnis

# #32912
source: English
ga: Béarla

# #32913
source: Estonian
ga: Eastóinis

# #32914
source: Finnish
ga: Fionlainnis

# #32915
source: French
ga: Fraincis

# #32916
source: German
ga: Gearmáinis

# #32917
source: Greek
ga: Gréigis

# #32918
source: Hebrew
ga: Eabhrais

# #32919
source: Hindi
ga: Hiondúis

# #32920
source: Hungarian
ga: Ungáiris

# #32921
source: Icelandic
ga: Íoslainnis

# #32922
source: Indonesian
ga: Indinéisis

# #32924
source: Italian
ga: Iodáilis

# #32925
source: Japanese
ga: Seapáinis

# #32926
source: Korean
ga: Cóiréach

# #32927
source: Latvian
ga: Laitvis

# #32928
source: Lithuanian
ga: Liotuáinis

# #32929
source: Macedonian
ga: Macadóinis

# #32930
source: Norwegian
ga: Ioruais

# #32932
source: Polish
ga: Polainnis

# #32933
source: Portuguese
ga: Portaingéilis

# #32934
source: Portuguese (Brazil)
ga: Portaingéilis (an Bhrasaíl)

# #32935
source: Romanian
ga: Rómáinis

# #32936
source: Russian
ga: Rúisis

# #32937
source: SerbianLatin
ga: SeirbisLaidin

# #32938
source: Slovak
ga: Slóvaicis

# #32939
source: Slovenian
ga: Slóivéinis

# #32940
source: Spanish
ga: Spáinnis

# #32942
source: Swedish
ga: Sualainnis

# #32943
source: Thai
ga: Téalainnis

# #32944
source: Turkish
ga: Tuircis

# #32945
source: Ukrainian
ga: Úcránach

# #32946
source: Vietnamese
ga: Vítneamach
